Reports/СостояниеПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СостояниеПроектов</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ДатыКомплектаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплектаПроизводство</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПодрядчик</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПодрядчик</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремениПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БезГабаритногоЧертежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЗамера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДоработки_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДоработки_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМонтажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроектирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанПереходКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанПереходКарточки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерВКолонке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДКудаДорожка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДКудаКолонка</Name>
					<Comment>Пустая строка  выполнена. 00000000-0000-0000-0000-000000000000  корзина.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДПерехода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДКарточка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанКолонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанКолонки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитКарточек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/СостояниеПроектов/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьОтчетНаСервере();
КонецПроцедуры

Процедура СформироватьОтчетНаСервере()
	мПроекты 	= ПолучитьПроекты();
	стТаблицы 	= ПолучитьТаблицуДанных(мПроекты);
	
	ВывестиДанные(стТаблицы);
КонецПроцедуры // СформироватьОтчетНаСервере()

Процедура ВывестиДанные(стТаблицы)

	стОтбор = Новый Структура("ИзделиеКомплект", );
	
	ПустаяДата = Дата(1,1,1);
	
	Таб = ЭтаФорма.ПолеВывода;
	Таб.Очистить();
	
	Макет = Отчеты.СостояниеПроектов.ПолучитьМакет("Макет");
	
	Таб.Вывести(Макет.ПолучитьОбласть("Шапка"));
	Таб.ФиксацияСверху = Таб.ВысотаТаблицы;
	
    обСтрока 	= Макет.ПолучитьОбласть("Строка"); 
	
	Согласование 	= "";
	Утверждение 	= "";
	
	Для каждого текСтрока Из стТаблицы.тзДанные Цикл
		обСтрока.Параметры.Заполнить(текСтрока); 
		
		//
		//Если НЕ текСтрока.НаСогласование = ПустаяДата Тогда
		//	Согласование = Согласование + " " + Формат(текСтрока.НаСогласование, "ДФ=dd.MM.yyyy");	
		//КонецЕсли;
		//
		//обСтрока.Параметры.Согласование = Согласование;
		//
		//Если НЕ текСтрока.НаУтверждение = ПустаяДата Тогда
		//	Утверждение = Утверждение + " " + Формат(текСтрока.НаУтверждение, "ДФ=dd.MM.yyyy");	
		//КонецЕсли;
		//
		//обСтрока.Параметры.Утверждение = Утверждение;
		//
		//стОтбор.ИзделиеКомплект = текСтрока.ИзделиеКомплект;
		//
		//мПроизводственныеКомплекты = стТаблицы.тзПроизводственныеКомплекты.НайтиСтроки(стОтбор);
		//КоличествоПроизводственныхКомплектов = мПроизводственныеКомплекты.Количество();
		//
		//Для х = 0 По КоличествоПроизводственныхКомплектов - 1 Цикл
		//	ВывестиОсновныеПроизводственныеКомплекты(х + 1,обСтрока, мПроизводственныеКомплекты[х]);
		//КонецЦикла;
		//
		Таб.Вывести(обСтрока);
	КонецЦикла; 
	
	Таб.Вывести(Макет.ПолучитьОбласть("ПоследняяСтрока"));
КонецПроцедуры // ВывестиДанные()

Процедура ВывестиОсновныеПроизводственныеКомплекты(НомерИндекса, обСтрока, СтрокаДанных)
	
	ЗаполнитьДанныеПроизводственногоКоплекта(обСтрока, НомерИндекса, "ПроизводственныйКомплект", 	СтрокаДанных);
	//ЗаполнитьДанныеПроизводственногоКоплекта(обСтрока, НомерИндекса, "Столярка", 					СтрокаДанных);
	//ЗаполнитьДанныеПроизводственногоКоплекта(обСтрока, НомерИндекса, "Малярка", 					СтрокаДанных);
	//ЗаполнитьДанныеПроизводственногоКоплекта(обСтрока, НомерИндекса, "Подряд", 						СтрокаДанных);
	//ЗаполнитьДанныеПроизводственногоКоплекта(обСтрока, НомерИндекса, "ПсиДата", 					СтрокаДанных);
	//ЗаполнитьДанныеПроизводственногоКоплекта(обСтрока, НомерИндекса, "ДогДата", 					СтрокаДанных);
	
КонецПроцедуры // ВывестиОсновныеПроизводственныеКомплекты()

Процедура ЗаполнитьДанныеПроизводственногоКоплекта(обСтрока,НомерИндекса,ИмяПараметра, СтрокаДанных)

	Если СтрокаДанных = Неопределено Тогда
		обСтрока.Параметры[ИмяПараметра + НомерИндекса] = СтрокаДанных;
	Иначе
		//обСтрока.Параметры[ИмяПараметра + НомерИндекса] = СтрокаДанных[ИмяПараметра];
	КонецЕсли;

КонецПроцедуры // ЗаполнитьДанныеПроизводственногоКоплекта()

Функция ПолучитьТаблицуДанных(мПроекты)

	тзДанные 					= ЗаполнитьКомплектыИзделий(мПроекты);
	Комплекты 					= омТЧ_НаКлиентеСервере.КолонкуВМассив(тзДанные,"ИзделиеКомплект");
	//тзПроизводственныеКомплекты = ЗаполнитьПроизводственныеКомплекты(Комплекты);
	//тзПроизводственныеКомплекты.Индексы.Добавить("ИзделиеКомплект");
	
	РассчитатьПоля(тзДанные);
	
	Возврат Новый Структура("тзДанные, тзПроизводственныеКомплекты", тзДанные, Новый ТаблицаЗначений);
	
КонецФункции // ПолучитьТаблицуДанных()

Процедура РассчитатьПоля(тзДанные)
	
	СекундВСутках = 24 * 3600;
	
	ПустаяДата 	= Дата(1,1,1);
	ТД			= НачалоДня(ТекущаяДата());
	
	типДата 	= Новый ОписаниеТипов("Дата");
	типСтрока 	= Новый ОписаниеТипов("Строка");
	типЧисло 	= Новый ОписаниеТипов("Число");

	тзДанные.Колонки.Добавить("ЗапасПКД",			типЧисло);
	тзДанные.Колонки.Добавить("ЗапасРКД",			типЧисло);
	тзДанные.Колонки.Добавить("ЗапасТЗ",			типСтрока);
	тзДанные.Колонки.Добавить("ОстатокПКД",			типСтрока);
	тзДанные.Колонки.Добавить("ПланПКДСтрокой",		типСтрока);
	тзДанные.Колонки.Добавить("ОстатокРКД",			типСтрока);
	тзДанные.Колонки.Добавить("ПланРКДСтрокой",		типСтрока);
	
	Для каждого х Из тзДанные Цикл
		//Если НЕ (х.ДатаВнешнегоСоглосования = ПустаяДата ИЛИ х.КрайПКД = ПустаяДата) Тогда
		//	х.ЗапасПКД = (х.КрайПКД - х.ДатаВнешнегоСоглосования) / СекундВСутках; 
		//КонецЕсли; 
		
		//ЗапасТЗ+
		Если ЗначениеЗаполнено(х.КрайТЗ) Тогда
			ЗапасТЗ 	= ""; 
			РазницаДат 	= (х.КрайТЗ - ТД) / СекундВСутках; 
			
			Если х.ГотовностьТЗ = ПустаяДата Тогда
				Если РазницаДат > 0 Тогда
					ЗапасТЗ = "Запас тек "; 
				Иначе	
					ЗапасТЗ = "Опоздание тек "; 
					РазницаДат = -РазницаДат;	
				КонецЕсли;
			Иначе
				Если РазницаДат > 0 Тогда
					ЗапасТЗ = "Запас по готов"; 
				Иначе	
					ЗапасТЗ = "Опоздание по готов "; 
					РазницаДат = -РазницаДат;	
				КонецЕсли;
			КонецЕсли;
			х.ЗапасТЗ = ЗапасТЗ + РазницаДат;
		Иначе
			х.ЗапасТЗ = "";
		КонецЕсли;
		
		х.ПланПКДСтрокой 	= Формат(х.НачалоПКД,"ДФ=dd.MM.yy") + "-" + Формат(х.КрайПКД,"ДФ=dd.MM.yy");	
		Если ЗначениеЗаполнено(х.КрайПКД) И ЗначениеЗаполнено(х.НачалоПКД) Тогда
			х.ОстатокПКД 	= "Осталось " + (х.НачалоПКД - х.КрайПКД) / СекундВСутках;
		КонецЕсли;
		
		х.ПланРКДСтрокой 	= Формат(х.НачалоРКД,"ДФ=dd.MM.yy") + "-" + Формат(х.КрайРКД,"ДФ=dd.MM.yy");	
		Если ЗначениеЗаполнено(х.НачалоРКД) И ЗначениеЗаполнено(х.КрайРКД) Тогда
			х.ОстатокРКД 	= "Осталось " + (х.НачалоРКД - х.КрайРКД) / СекундВСутках;
		КонецЕсли;
		
	КонецЦикла;


КонецПроцедуры //РассчитатьПоля(тзДанные)

Функция ЗаполнитьПроизводственныеКомплекты(Комплекты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплектаПроизводство.КрайПроизводства КАК ПроизводственныйКомплект,
		|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект,
		|	ДатыКомплектаПроизводство.КрайСтолярка КАК КрайСтолярка,
		|	ДатыКомплектаПроизводство.КрайМалярка КАК КрайМалярка,
		|	ДатыКомплектаПроизводство.КрайПодрядчик КАК КрайПодрядчик,
		|	ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент.Ссылка КАК ИзделиеЭлемент,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка КАК ИзделиеЗаказчика
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект КАК ИзделияКомплект
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплектаПроизводство КАК ДатыКомплектаПроизводство
		|			ПО (ДатыКомплектаПроизводство.Комплект = ИзделияКомплект.Ссылка)
		|		ПО ИзделияКомплектИзделияЭлемент.Ссылка = ИзделияКомплект.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|		ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
		|ГДЕ
		|	ИзделияКомплект.Ссылка В(&ИзделиеКомплект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.ПроизводственныйКомплект КАК ПроизводственныйКомплект,
		|	вт.КрайСтолярка КАК Столярка,
		|	вт.КрайМалярка КАК Малярка,
		|	вт.ИзделиеКомплект КАК ИзделиеКомплект,
		|	вт.КрайПодрядчик КАК Подряд,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ДатаДоговора КАК ДогДата
		|ИЗ
		|	Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика = вт.ИзделиеЗаказчика
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.КрайСтолярка,
		|	вт.ПроизводственныйКомплект,
		|	вт.ИзделиеКомплект,
		|	вт.КрайМалярка,
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ДатаДоговора,
		|	вт.КрайПодрядчик
		|
		|УПОРЯДОЧИТЬ ПО
		|	вт.ИзделиеКомплект.Наименование";
	
	Запрос.УстановитьПараметр("ИзделиеКомплект", Комплекты);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ЗаполнитьПроизводственныеКомплекты(Комплекты)

Функция ЗаполнитьКомплектыИзделий(мПроекты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект,
		|	ИзделияКомплект.Проект.Префикс КАК ПрефиксСделки,
		|	ИзделияКомплект.ОсновноеПомещение.Ссылка КАК Помещение,
		|	ИзделияКомплект.Наименование КАК Наименование,
		|	ЕСТЬNULL(ДатыКомплекта.КрайПКД, ДАТАВРЕМЯ(1, 1, 1)) КАК КрайПКД,
		|	ЕСТЬNULL(ДатыКомплекта.КрайРКД, ДАТАВРЕМЯ(1, 1, 1)) КАК КрайРКД,
		|	ЕСТЬNULL(ДатыКомплекта.КрайТЗ, ДАТАВРЕМЯ(1, 1, 1)) КАК КрайТЗ,
		|	ЕСТЬNULL(ИзделияКомплект.Родитель.Композиция, ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяСсылка)) КАК Композиция,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ИзделияКомплект.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	ВЫБОР
		|		КОГДА КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = ""1""
		|			ТОГДА ""Завершен""
		|		КОГДА КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = ""00000000-0000-0000-0000-000000000000""
		|			ТОГДА ""Удален""
		|		ИНАЧЕ ЕСТЬNULL(КанбанКолонки.Наименование, """")
		|	КОНЕЦ КАК СостояниеТЗ,
		|	ВЫБОР
		|		КОГДА КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = ""1""
		|				ИЛИ КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = ""00000000-0000-0000-0000-000000000000""
		|			ТОГДА КанбанПереходКарточкиСрезПоследних.Период
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ГотовностьТЗ,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ЕСТЬNULL(ДатыКомплекта.НачалоПКД, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоПКД,
		|	ЕСТЬNULL(ДатыКомплекта.ДнейПКД, 0) КАК ДнейПКД,
		|	ЕСТЬNULL(ДатыКомплекта.НачалоРКД, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоРКД,
		|	ЕСТЬNULL(ДатыКомплекта.ДнейРКД, 0) КАК ДнейРКД
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ПО (ДатыКомплекта.Комплект = ИзделияКомплект.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО ИзделияКомплект.Ссылка = ДанныеКомплектаСрезПоследних.Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|			ПО КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = КанбанКолонки.УИД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|			ПО (КанбанКарточки.УИД = КанбанПереходКарточкиСрезПоследних.УИДКарточка)
		|		ПО (ВЫБОР
		|				КОГДА ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяСсылка) = ЕСТЬNULL(ИзделияКомплект.Родитель.Композиция, ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяСсылка))
		|					ТОГДА ИзделияКомплект.Ссылка = КанбанКарточки.Ресурс
		|				ИНАЧЕ ИзделияКомплект.Родитель.Композиция = КанбанКарточки.Ресурс
		|			КОНЕЦ)
		|ГДЕ
		|	ИзделияКомплект.Проект В(&мПроекты)
		|	И НЕ ИзделияКомплект.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Запрос.УстановитьПараметр("мПроекты", мПроекты);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ЗаполнитьКомплектыИзделий(мСделки)

&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	СформироватьОтчетНаСервере();
КонецПроцедуры 

&НаСервере
Функция ПолучитьПроекты()

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Проект
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА НЕ Проекты.НеВыводитьНаДиаграмму
		|			ИНАЧЕ Проекты.Ссылка = &Проект
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Проект");
	
	
КонецФункции // ПолучитьСделки()
